# кратность числа

# num = int(input("Введите число: "))
# if (num % 10 == 0 or num % 15 == 0) and not num % 30 == 0:
#     print("Выполняется")
# else:
#     print("Не выполняется")


### П. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:*
# - Для N = 5: 1, -3, 9, -27, 81

# num = int(input("Введите число: "))

# for num in range(i)


#..... бесят