# кратность числа

# num = int(input("Введите число: "))
# if (num % 10 == 0 or num % 15 == 0) and not num % 30 == 0:
#     print("Выполняется")
# else:
#     print("Не выполняется")


# П. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:*
# - Для N = 5: 1, -3, 9, -27, 81

# num = int(input("Введите число: "))

# for num in range(i)


# n = int(input("Введи чило:"))
# for i in range(n):
#     print(f'{(-3)**i}')



# my_dict = {}
# my_dict[1] = {"name": "Валера"}
# my_dict[2] = "Два"
# my_dict[3] = "Три"
# my_dict[4] = "Четыре"

# # print(my_dict[2])

# # for key, value in my_dict.items():
# #     if value == "Три":
# #         print(key)

# # print(my_dict)
# # my_dict.pop(3)
# # print(my_dict)


# for i in range(10):
#     my_dict[i] = "Новое значение"

# print(my_dict)


# Для натурального n создать словарь ключ-значение,
# состоящий из элементов последовательности 3n + 1.

# Пример:
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

